Revit 2027 API
DefinitionBindingMap Methods
The DefinitionBindingMap type exposes the following members.
Methods
Name | Description
Clear | Removes every binding from the map, rendering it empty.
Contains
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Erase
ForwardIterator | Retrieve a forward moving iterator to the map.
GetEnumerator | Retrieve a forward moving iterator to the map.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Insert
ReverseIterator | Retrieve a backward moving iterator to the map.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace